import { Footer } from "../../../components/Footer";
import styled from "styled-components";

const HistoryContainer = styled.div`
  display: flex;
  flex-direction: column;
  align-items: center;
  height: 100vh; /* 화면 높이 맞춤 */
  width: 100vw; /* 화면 너비 맞춤 */
  margin: 0 auto;
  background-color: black;
  padding: 20px 0; /* 상하 여백 추가 */
`;

const HistoryTextBox = styled.div`
  color: ${(props) => props.fontColor};
  text-align: center;
  font-size: ${(props) => props.fontSize};
  line-height: 150%;
  letter-spacing: -0.011em;
  font-weight: 700;
  margin: ${(props) => props.margin || '10px 0'}; /* 기본 여백 설정 */
`;

const PurchaseHistoryList = styled.div`
  width: 90%;
  display: flex;
  flex-direction: column;
  align-items: center;
  margin-top: 20px;
`;

const PurchaseItem = styled.div`
  width: 90%;
  background-color: #1a1a1a;
  color: #87cefa;
  border: 1px solid #87cefa;
  border-radius: 15px;
  margin-bottom: 10px;
  padding: 10px;
  text-align: center;
`;

const PurchaseImageContainer = styled.div`
  display: grid;
  grid-template-columns: repeat(5, 1fr);
  grid-template-rows: repeat(2, 1fr);
  gap: 15px;
  justify-content: center;
  align-items: center;
  background-color: #333;
  border-radius: 20px;
  padding: 20px;
  margin: 15px 0;
  width: 80%;
  place-items: center; 

`;

const Circle = styled.div`
  width: 40px;
  height: 40px;
  border: 3px solid #444;
  border-radius: 50%;
  display: flex;
  justify-content: center;
  align-items: center;
`;

const PurchaseImage = styled.img`
  width: 30px;
  height: 30px;
`;

const HistoryPage = () => {
  return (
    <>
      <HistoryContainer>
        <HistoryTextBox fontSize="24px" fontColor="#ffffff" margin="60px 0">
          구매한 상품 이력
        </HistoryTextBox>
        <HistoryTextBox fontSize="16px" fontColor="#ffffff" margin="0">
          이번달 구매 인증
        </HistoryTextBox>
        <PurchaseImageContainer>
          <Circle>
            <svg width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M85.297 19.6481L88.6912 11.5486C88.7534 11.3999 88.7857 11.2402 88.7857 11.0779V1.2298C88.7857 0.783723 88.5419 0.373282 88.1477 0.155772C87.7534 -0.0617373 87.2721 -0.0506775 86.8878 0.184036L82.235 3.02763L77.5821 0.184036C77.1817 -0.0605084 76.6742 -0.0605084 76.2737 0.184036L71.6209 3.02763L66.9681 0.184036C66.5676 -0.0605084 66.0602 -0.0605084 65.6597 0.184036L61.0069 3.02763L56.3541 0.184036C55.9536 -0.0605084 55.4461 -0.0605084 55.0457 0.184036L50.3929 3.02763L45.74 0.184036C45.3396 -0.0605084 44.8321 -0.0605084 44.4316 0.184036L39.7788 3.02763L35.126 0.184036C34.7255 -0.0605084 34.2181 -0.0605084 33.8176 0.184036L29.1648 3.02763L24.512 0.185265C24.1115 -0.0592795 23.604 -0.0592795 23.2036 0.185265L18.5508 3.02886L13.8979 0.185265C13.5136 -0.0494486 13.0323 -0.0592795 12.638 0.157001C12.2438 0.373282 12 0.784952 12 1.2298V11.0779C12 11.2389 12.0323 11.3987 12.0945 11.5486L15.4887 19.6481V80.3504L12.0945 88.4523C12.0323 88.601 12 88.7608 12 88.923V98.7699C12 99.216 12.2438 99.6264 12.638 99.8439C13.0323 100.061 13.5136 100.05 13.8979 99.8157L18.5508 96.9721L23.2036 99.8157C23.604 100.06 24.1115 100.06 24.512 99.8157L29.1648 96.9721L33.8176 99.8157C34.2181 100.06 34.7255 100.06 35.126 99.8157L39.7788 96.9721L44.4316 99.8157C44.8321 100.06 45.3396 100.06 45.74 99.8157L50.3929 96.9721L55.0457 99.8157C55.4461 100.06 55.9536 100.06 56.3541 99.8157L61.0069 96.9721L65.6597 99.8157C66.0602 100.06 66.5676 100.06 66.9681 99.8157L71.6209 96.9721L76.2737 99.8157C76.474 99.9386 76.7016 100 76.9279 100C77.1543 100 77.3819 99.9386 77.5821 99.8157L82.235 96.9721L86.8878 99.8157C87.2721 100.05 87.7534 100.06 88.1477 99.8439C88.5419 99.6264 88.7857 99.216 88.7857 98.7699V88.923C88.7857 88.762 88.7534 88.6022 88.6912 88.4523L85.297 80.3516V19.6481ZM86.2982 89.1663V92.6157H14.4875V89.1663L14.5895 88.9218H86.195L86.297 89.1663H86.2982ZM14.4875 10.8346V7.38397H86.2982V10.8346L86.1963 11.0792H14.5895L14.4875 10.8346ZM17.9761 62.4925V35.3259H82.8096V62.4925H17.9761Z" fill="#FF5858" />
            </svg>

          </Circle>
          <Circle>
            <svg width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M84.6429 11.0695C84.6429 11.0695 84.6429 11.0659 84.6429 11.0646C84.6429 11.0549 84.6429 11.0451 84.6416 11.0366C84.6416 11 84.6379 10.9622 84.6342 10.9268C84.633 10.9134 84.6305 10.9 84.6281 10.8866C84.6232 10.8537 84.617 10.8195 84.6084 10.7878C84.6047 10.7744 84.6022 10.7622 84.5985 10.7488C84.5887 10.7134 84.5776 10.6793 84.5653 10.6463C84.5628 10.639 84.5616 10.6329 84.5591 10.6256L82.5617 5.57439L80.6628 0.77439C80.4781 0.307317 80.0224 0 79.5163 0H20.1266C19.6192 0 19.1648 0.307317 18.9801 0.77439L15.0837 10.6256C15.0813 10.6329 15.08 10.639 15.0776 10.6463C15.0653 10.6805 15.0542 10.7146 15.0443 10.7488C15.0406 10.7622 15.0369 10.7744 15.0345 10.7878C15.0271 10.8207 15.0209 10.8537 15.0148 10.8866C15.0123 10.9 15.0099 10.9134 15.0086 10.9268C15.0049 10.9634 15.0025 11 15.0012 11.0366C15.0012 11.0463 15 11.0561 15 11.0646C15 11.0659 15 11.0683 15 11.0695V88.9317C15 88.9317 15 88.9354 15 88.9366C15 88.9463 15 88.9561 15.0012 88.9659C15.0012 89.0024 15.0049 89.039 15.0086 89.0756C15.0099 89.089 15.0123 89.1024 15.0148 89.1159C15.0197 89.1488 15.0259 89.1817 15.0333 89.2146C15.0369 89.2281 15.0394 89.2402 15.0431 89.2537C15.0529 89.289 15.064 89.3232 15.0764 89.3561C15.0788 89.3634 15.08 89.3695 15.0825 89.3768L17.0799 94.4256L18.9789 99.2256C19.1636 99.6927 19.6192 100 20.1253 100H79.5151C80.0224 100 80.4768 99.6927 80.6615 99.2256L84.5579 89.3768C84.5603 89.3695 84.5628 89.3622 84.5653 89.3549C84.5776 89.3219 84.5887 89.2878 84.5985 89.2537C84.6022 89.2402 84.6059 89.2268 84.6084 89.2146C84.6158 89.1829 84.6219 89.15 84.6269 89.1171C84.6293 89.1037 84.6318 89.0902 84.633 89.0768C84.6367 89.0402 84.6392 89.0037 84.6404 88.9671C84.6404 88.9573 84.6416 88.9476 84.6416 88.9378C84.6416 88.9366 84.6416 88.9342 84.6416 88.9329V11.0695H84.6429ZM81.6073 9.85H18.0343L19.0183 7.36341H80.6246L81.6085 9.85H81.6073ZM61.0653 69.8195C55.6271 66.8695 52.7024 63.6305 49.875 60.4976C46.3518 56.5939 43.0244 52.9073 35.5568 50.2427C29.9783 48.2512 23.8949 46.9232 17.4592 46.2902V23.5829C23.603 24.2061 29.4044 25.4805 34.7206 27.378C41.602 29.8341 44.5846 33.1378 48.0377 36.9634C51.0042 40.25 54.0718 43.6488 59.8806 46.8C65.9074 50.0683 73.4058 52.3732 82.1787 53.6561V76.3476C73.8516 75.0976 66.7534 72.9037 61.0641 69.8183L61.0653 69.8195ZM18.0343 90.1512H81.6073L80.6246 92.6366H19.0183L18.0356 90.1512H18.0343ZM20.9652 2.43902H78.6752L79.6591 4.92561H19.9825L20.9664 2.43902H20.9652ZM78.6752 97.561H20.9652L19.9813 95.0744H79.6579L78.674 97.561H78.6752Z" fill="#5D9EFF" />
            </svg>
          </Circle>
          {/* Add additional circles */}
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
          <Circle></Circle>
        </PurchaseImageContainer>
        <HistoryTextBox fontSize="16px" fontColor="#FFFA87" margin="0 0 40px 0">
          이번 달에는 구매 인증을 2회 했어요.
          <br />
          8회 더 인증 시 구독료 1,000원 할인 혜택이 있어요.
        </HistoryTextBox>
        <HistoryTextBox fontSize="16px" fontColor="#ffffff" margin="0">
          구매한 상품 히스토리
        </HistoryTextBox>
        <PurchaseHistoryList>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
          <PurchaseItem>포카리스웨트 2024년 01월 01일 구매</PurchaseItem>
        </PurchaseHistoryList>
      </HistoryContainer>
      <Footer />
    </>
  );
};

export default HistoryPage;
